axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
void ESP32CSWebServer::handleOutputs(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE)) {
    JsonArray &array = jsonResponse->getRoot();
    OutputManager::getState(array);
  } else if (request->method() == HTTP_GET) {
    auto output = OutputManager::getOutput(request->arg(JSON_ID_NODE).toInt());
    if(output) {
      output->toJson(jsonResponse->getRoot(), true);
    } else {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  } else if(request->method() == HTTP_POST) {
    uint16_t outputID = request->arg(JSON_ID_NODE).toInt();
    uint8_t pin = request->arg(JSON_PIN_NODE).toInt();
    bool inverted = request->arg(JSON_INVERTED_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool forceState = request->arg(JSON_FORCE_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool defaultState = request->arg(JSON_DEFAULT_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    uint8_t outputFlags = 0;
    if(inverted) {
      bitSet(outputFlags, OUTPUT_IFLAG_INVERT);
    }
    if(forceState) {
      bitSet(outputFlags, OUTPUT_IFLAG_RESTORE_STATE);
      if(defaultState) {
        bitSet(outputFlags, OUTPUT_IFLAG_FORCE_STATE);
      }
    }
    if(!OutputManager::createOrUpdate(outputID, pin, outputFlags)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  } else if(request->method() == HTTP_DELETE) {
    if(!OutputManager::remove(request->arg(JSON_ID_NODE).toInt())) {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  } else if(request->method() == HTTP_PUT) {
   OutputManager::toggle(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void ESP32CSWebServer::handleTurnouts(AsyncWebServerRequest *request) {
  // GET /turnouts - full list of turnouts, note that turnout state is STRING type for display
  // GET /turnouts?readbleStrings=[0,1] - full list of turnouts, turnout state will be returned as true/false (boolean) when readableStrings=0.
  // GET /turnouts?address=<address> - retrieve turnout by DCC address
  // GET /turnouts?id=<id> - retrieve turnout by ID
  // PUT /turnouts?address=<address> - toggle turnout by DCC address
  // PUT /turnouts?id=<id> - toggle turnout by ID
  // POST /turnouts?id=<id>&address=<address>&subAddress=<subAddress>&type=<type> - creates a new turnout
  //      when id is -1 it will be auto-assigned as number of defined turnouts + 1.
  //      if subAddress is -1 the turnout will be defined as DCC address only.
  // DELETE /turnouts?id=<id> - delete turnout by ID
  // DELETE /turnouts?address=<address> - delete turnout by DCC address
  //
  // For successful requests the result code will be 200 and either an array of turnouts or single turnout will be returned.
  // For unsuccessful requests the result code will be 400 (bad request, missing args), 401 (not found), 500 (server failure).
  //

  // if the request is GET and we do not have an ID or ADDRESS parameter we need to return an array, otherwise a single entity.
  bool needArrayResponse = (
    request->method() == HTTP_GET &&
    !request->hasArg(JSON_ID_NODE) &&
    !request->hasArg(JSON_ADDRESS_NODE));
  auto jsonResponse = new AsyncJsonResponse(needArrayResponse);
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE)) {
    bool readableStrings = true;
    if(request->hasArg(JSON_TURNOUTS_READABLE_STRINGS_NODE)) {
      readableStrings = request->arg(JSON_TURNOUTS_READABLE_STRINGS_NODE).toInt();
    }
    JsonArray &array = jsonResponse->getRoot();
    TurnoutManager::getState(array, readableStrings);
  } else if (request->method() == HTTP_GET) {
    if(request->hasArg(JSON_ID_NODE)) {
      auto turnout = TurnoutManager::getTurnoutByID(request->arg(JSON_ID_NODE).toInt());
      if(turnout) {
        turnout->toJson(jsonResponse->getRoot());
      } else {
        jsonResponse->setCode(STATUS_NOT_FOUND);
      }
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      auto turnout = TurnoutManager::getTurnoutByID(request->arg(JSON_ADDRESS_NODE).toInt());
      if(turnout) {
        turnout->toJson(jsonResponse->getRoot());
      } else {
        jsonResponse->setCode(STATUS_NOT_FOUND);
      }
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  } else if(request->method() == HTTP_POST) {
    int32_t turnoutID = request->arg(JSON_ID_NODE).toInt();
    uint16_t turnoutAddress = request->arg(JSON_ADDRESS_NODE).toInt();
    int8_t turnoutSubAddress = request->arg(JSON_SUB_ADDRESS_NODE).toInt();
    TurnoutType type = (TurnoutType)request->arg(JSON_TYPE_NODE).toInt();
    // auto generate ID
    if(turnoutID == -1) {
      turnoutID = TurnoutManager::getTurnoutCount() + 1;
    }
    auto turnout = TurnoutManager::createOrUpdate((uint16_t)turnoutID, turnoutAddress, turnoutSubAddress, type);
    if(turnout) {
      turnout->toJson(jsonResponse->getRoot());
    } else {
      jsonResponse->setCode(STATUS_SERVER_ERROR);
    }
  } else if(request->method() == HTTP_DELETE) {
    if(request->hasArg(JSON_ID_NODE)) {
      TurnoutManager::removeByID(request->arg(JSON_ID_NODE).toInt());
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      TurnoutManager::removeByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  } else if(request->method() == HTTP_PUT) {
    if(request->hasArg(JSON_ID_NODE)) {
      TurnoutManager::toggleByID(request->arg(JSON_ID_NODE).toInt());
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      TurnoutManager::toggleByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    } else {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void ESP32CSWebServer::handleSensors(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE)) {
    JsonArray &array = jsonResponse->getRoot();
    SensorManager::getState(array);
  } else if (request->method() == HTTP_GET) {
    auto sensor = SensorManager::getSensor(request->arg(JSON_ID_NODE).toInt());
    if(sensor) {
      sensor->toJson(jsonResponse->getRoot());
    } else {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  } else if(request->method() == HTTP_POST) {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    uint8_t sensorPin = request->arg(JSON_PIN_NODE).toInt();
    bool sensorPullUp = request->arg(JSON_PULLUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    if(!SensorManager::createOrUpdate(sensorID, sensorPin, sensorPullUp)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  } else if(request->method() == HTTP_DELETE) {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    if(SensorManager::getSensorPin(sensorID) < 0) {
      // attempt to delete S88/RemoteSensor
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    } else if(!SensorManager::remove(sensorID)) {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

